In [1]:
import pandas as pd

In [2]:
from pandasql import sqldf

In [4]:
pysqldf = lambda q: sqldf(q, globals())

In [5]:
surveys_df = pd.read_csv("surveys.csv")

In [6]:
species_df = pd.read_csv("species.csv")

In [9]:
#pysqldf("SELECT * FROM surveys_df")

In [21]:
first_five = pysqldf("SELECT * FROM surveys_df LIMIT 5")

In [11]:
first_five

   record_id  month  day  year  plot_id species_id sex  hindfoot_length weight
0          1      7   16  1977        2         NL   M             32.0   None
1          2      7   16  1977        3         NL   M             33.0   None
2          3      7   16  1977        2         DM   F             37.0   None
3          4      7   16  1977        7         DM   M             36.0   None
4          5      7   16  1977        3         DM   M             35.0   None

In [19]:
last_five = pysqldf("SELECT * FROM surveys_df ORDER BY record_id DESC LIMIT 5")

In [20]:
last_five

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,35549,12,31,2002,5,None,None,NaN,NaN
1,35548,12,31,2002,7,DO,M,36.0,51.0
2,35547,12,31,2002,10,RM,F,15.0,14.0
3,35546,12,31,2002,15,AH,None,NaN,NaN
4,35545,12,31,2002,15,AH,None,NaN,NaN

In [23]:
#pysqldf("SELECT DISTINCT species_id FROM surveys_df")